# EnableLBSorting

## Description
Enables/disables sorting.

```pascal
PROCEDURE EnableLBSorting(
				dialogID      : LONGINT;
				componentID   : LONGINT;
				enableSorting : BOOLEAN);
```

```python
def vs.EnableLBSorting(dialogID, componentID, enableSorting):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|enableSorting|BOOLEAN|specifies whether to enable or disable sorting|

## Version
Availability: from VectorWorks11.0

## Category
* Dialogs - Modern - Browser